// На круглой грядке по окружности растет N кустов. 
// Таким образом, у каждого куста есть ровно два соседних. 
// Эти кусты обладают разной урожайностью, 
// поэтому ко времени сбора на них выросло различное число ягод 
// на i-ом кусте выросло ai ягод. Собирающий модуль за один заход, 
// находясь непосредственно перед некоторым кустом,
// собирает ягоды с этого куста и с двух соседних с ним. 
// Напиши программу для нахождения максимального числа ягод, 
// которое может собрать за один заход собирающий модуль, 
// находясь перед некоторым кустом заданной во входном файле грядки.

Console.Clear();
Console.Write("Введите число кустов: ");
int N = Convert.ToInt32(Console.ReadLine());

int a[i] = [1, 2, 3, 4];

